levkropp/cyd-emulator/test-firmware/50-lvgl-basic/sdkconfig.defaults
# ESP32 target
CONFIG_IDF_TARGET="esp32"

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Enable LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
